spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2001.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
	<soapenv:Header/>
	<soapenv:Body>
		<application xmlns="http://sv.bpc.in/SVAP">
			<application_type>APTPACQA</application_type>
			<!-- Application type - Acquiring -->
			<application_flow_id>2001</application_flow_id>
			<!-- Application flow (business process) - Create new acquirer customer -->
			<application_status>APST0006</application_status>
			<!-- Application status - Ready to process -->
			<operator_id>ADMIN</operator_id>
			<!-- User name who made this application -->
			<institution_id>1001</institution_id>
			<!-- Institution identifier -->
			<agent_id>10000001</agent_id>
			<!-- Agent identifier -->
			<customer_type>ENTTCOMP</customer_type>
			<!-- Customer type - Company -->
			<customer>
				<command>CMMDCREX</command>
				<!-- Command for customer - Create new or raise error -->
				<customer_number>0000000000000000000697</customer_number>
				<customer_category>CCTGORDN</customer_category>
				<!-- Customer category - ordinary customer -->
				<customer_relation>RSCBEXTR</customer_relation>
				<!-- Customer and bank additional relation - No relation -->
				<account_scheme>1</account_scheme>
				<resident>1</resident>
				<!-- Resident flag -->
				<nationality>643</nationality>
				<!-- Customer nationality -->
				<company id="company_1">
					<!-- Person data -->
					<command>CMMDCRUP</command>
					<!-- Command for person - Create new or update if exists -->
					<incorp_form>INCF0065</incorp_form>
					<!-- Incorporation form - Limited liability company -->
					<company_name id="company_name_1" language="LANGENG">
						<!-- Company name. Attribute LANGUAGE contain code of language of provided company name - English -->
						<company_short_name>Food N Drinks Inc</company_short_name>
						<!-- Company short name -->
						<company_full_name>Food N Drinks Incorporation</company_full_name>
						<!-- Company full name -->
					</company_name>
					<identity_card id="identity_card_1">
						<!-- Identity card data -->
						<command>CMMDCRUP</command>
						<!-- Command for identity card - Create new or update if exists -->
						<id_type>IDTP0010</id_type>
						<!-- Identity card type - Taxpayer Identification Number -->
						<id_number>1234567890</id_number>
						<!-- Taxpayer Identification Number -->
					</identity_card>
				</company>
				<contact id="contact_1">
					<!-- Contact -->
					<command>CMMDCRUP</command>
					<!-- Command for contact - Create new or update if exists -->
					<contact_type>CNTTPRMC</contact_type>
					<!-- Contact type - Primary -->
					<preferred_lang>LANGENG</preferred_lang>
					<!-- Preferred language of speaking -->
					<contact_data id="contact_data_1">
						<commun_method>CMNM0001</commun_method>
						<!-- Communication method - Mobile phone -->
						<commun_address>04728428779</commun_address>
						<!-- Communication address - Mobile phone number -->
					</contact_data>
				</contact>
				<address id="address_1">
					<!-- Address -->
					<command>CMMDCRUP</command>
					<!-- Command for address - Create new or update if exists -->
					<address_type>ADTPHOME</address_type>
					<!-- Address type - Home address -->
					<country>643</country>
					<!-- Country ISO code - Russia -->
					<address_name id="address_name_1" language="LANGENG">
						<!-- Address. Attribute LANGUAGE contain code of language of provided address - English -->
						<region>Moscow</region>
						<!-- Region name -->
						<city>Moscow</city>
						<!-- Name of city -->
						<street>Street 3</street>
						<!-- Street -->
					</address_name>
					<house>17</house>
					<!-- House number -->
					<apartment>10</apartment>
					<!-- Appartment number -->
					<postal_code>234567</postal_code>
				</address>
				<contract>
					<command>CMMDCREX</command>
					<!-- Command for contract - Create new or raise error -->
					<contract_type>CNTPMRCM</contract_type>
					<!-- Contract type - Personal cards -->
					<product_id>1</product_id>
					<!-- Product identifier -->
					<contract_number>00000000000000000000000000000736</contract_number>
					<start_date>2015-01-13</start_date>
					<!-- Date when contract was signed -->
					<merchant id="merchant_1">
						<command>CMMDCREX</command>
						
						<merchant_number>000000070000063</merchant_number>

						<merchant_name>FOOD_N_DRINKS</merchant_name>
						<!-- Merchant system name -->
						<merchant_label language="LANGENG">Food n Drinks Central</merchant_label>
						<!-- Merchant official name -->
						<merchant_type>MRCTBANK</merchant_type>
						<!-- Parent merchant type -->
						<mcc>6536</mcc>
						<!-- Merchant Category Code -->
						<contact id="contact_2">
							<!-- Contact -->
							<command>CMMDCRUP</command>
							<!-- Command for contact - Create new or update if exists -->
							<contact_type>CNTTPRMC</contact_type>
							<!-- Contact type - Primary -->
							<preferred_lang>LANGENG</preferred_lang>
							<!-- Preferred language of speaking -->
							<contact_data id="contact_data_1">
								<commun_method>CMNM0001</commun_method>
								<!-- Communication method - Mobile phone -->
								<commun_address>79161234567</commun_address>
								<!-- Communication address - Mobile phone number -->
							</contact_data>
						</contact>
						<address id="address_2">
							<!-- Address -->
							<command>CMMDCRUP</command>
							<!-- Command for address - Create new or update if exists -->
							<address_type>ADTPBSNA</address_type>
							<!-- Address type - Home address -->
							<country>643</country>
							<!-- Country ISO code - Russia -->
							<address_name id="address_name_2" language="LANGENG">
								<!-- Address. Attribute LANGUAGE contain code of language of provided address - English -->
								<region>Moscow</region>
								<!-- Region name -->
								<city>Moscow</city>
								<!-- Name of city -->
								<street>Street 1</street>
								<!-- Street -->
							</address_name>
							<house>7</house>
							<!-- House number -->
							<apartment>1</apartment>
							<!-- Office number -->
							<postal_code>345678</postal_code>
						</address>

						<terminal id="terminal_1">
							<!-- New terminal registration -->
							<command>CMMDCREX</command>
							<!-- Create new object command -->

							<terminal_type>TRMT0003</terminal_type>
							<!-- Terminal type - POS -->
							<standard_id>1001</standard_id>
							<!-- Communication standard  -->
							<version_id>1003</version_id>
							<!-- Version number -->
							<terminal_template>10000007</terminal_template>
							<!-- Reference to terminal template -->
							<device_id>10000017</device_id>
							<!-- Communication device identifier -->
							<terminal_quantity>1</terminal_quantity>
						</terminal>

					</merchant>

					<service value="70000074">
						<!-- Service - attribute value contain service identifier which opened for account -->
						<service_object ref_id="account_1">
							<!-- Service reference - attribute ref_id contain reference on attached object - account -->
							<start_date>2015-01-13</start_date>
							<!-- Service open date -->
						</service_object>
					</service>

					<service value="70000072">
						<service_object ref_id="merchant_1">
							<start_date>2015-01-13</start_date>
						</service_object>
					</service>

					<service value="70000073">
						<service_object ref_id="terminal_1">
							<start_date>2015-01-13</start_date>
						</service_object>
					</service>

					<account id="account_1" >
						<!-- Account - value in attribute ID could be used as reference on this object -->
						<command>CMMDCREX</command>
						<!-- Command for account - Create new or raise error -->
						<account_number/>
						<!-- Account number  -->
						<currency>643</currency>
						<!-- Account currency code - US Dollars -->
						<account_type>ACTP0200</account_type>
						<!-- Account type - merchant account-->
						<account_object ref_id="merchant_1">
							<!-- Link account with merchant - ref_id contain reference on merchant object -->
							<account_link_flag>1</account_link_flag>
							<!-- Link/Unlink flag - Link -->
						</account_object>
					</account>
				</contract>
			</customer>
		</application>
	</soapenv:Body>
</soapenv:Envelope>
